"""
Напишите функцию add_2, которая будет возвращать значение своего аргумента увеличенное на 2
"""


def func(x):
    return x + 1


print(func(int(input())))
