"""
Напишите программу, которая выводит фразу "I want to become a software engineer"
три раза на отдельных строках
"""

print('I want to become a software engineer\n' * 3)
